modm-ext/data.modm.io/docs/svd/header_stm32f302x8.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C2</name>
      <description>Inter-integrated Circuit Interface</description>
      <baseAddress>0x40005800</baseAddress>
      <interrupt>
        <name>I2C2_EV</name>
        <description>I2C2 Event Interrupt &amp; EXTI Line24 Interrupt (I2C2 wakeup)</description>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>I2C2_ER</name>
        <description>I2C2 Error Interrupt</description>
        <value>34</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>USB</name>
      <description>Universal Serial Bus Full Speed Device</description>
      <baseAddress>0x40005c00</baseAddress>
      <interrupt>
        <name>USB_HP_CAN_TX</name>
        <description>USB Device High Priority or CAN TX Interrupts</description>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>USB_LP_CAN_RX0</name>
        <description>USB Device Low Priority or CAN RX0 Interrupts</description>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>USB_HP</name>
        <description>USB High Priority global Interrupt</description>
        <value>74</value>
      </interrupt>
      <interrupt>
        <name>USB_LP</name>
        <description>USB Low Priority global Interrupt</description>
        <value>75</value>
      </interrupt>
      <registers>
        <register>
          <name>EP0R</name>
          <description>USB Endpoint 0 register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>EP1R</name>
          <description>USB Endpoint 1 register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>EP2R</name>
          <description>USB Endpoint 2 register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>EP3R</name>
          <description>USB Endpoint 3 register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>EP4R</name>
          <description>USB Endpoint 4 register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>EP5R</name>
          <description>USB Endpoint 5 register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>EP6R</name>
          <description>USB Endpoint 6 register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>EP7R</name>
          <description>USB Endpoint 7 register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>CNTR</name>
          <description>Control register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>ISTR</name>
          <description>Interrupt status register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>FNR</name>
          <description>Frame number register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>DADDR</name>
          <description>Device address register</description>
          <addressOffset>0x4c</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>BTABLE</name>
          <description>Buffer Table address register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>LPMCSR</name>
          <description>LPM Control and Status register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x10</size>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CAN</name>
      <description>Controller Area Network</description>
      <baseAddress>0x40006400</baseAddress>
      <interrupt>
        <name>USB_HP_CAN_TX</name>
        <description>USB Device High Priority or CAN TX Interrupts</description>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>USB_LP_CAN_RX0</name>
        <description>USB Device Low Priority or CAN RX0 Interrupts</description>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>CAN_RX1</name>
        <description>CAN RX1 Interrupt</description>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>CAN_SCE</name>
        <description>CAN SCE Interrupt</description>
        <value>22</value>
      </interrupt>
      <registers>
        <register>
          <name>MCR</name>
          <description>CAN master control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INRQ</name>
              <description>Initialization Request</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SLEEP</name>
              <description>Sleep Mode Request</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXFP</name>
              <description>Transmit FIFO Priority</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RFLM</name>
              <description>Receive FIFO Locked Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NART</name>
              <description>No Automatic Retransmission</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AWUM</name>
              <description>Automatic Wakeup Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ABOM</name>
              <description>Automatic Bus-Off Management</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TTCM</name>
              <description>Time Triggered Communication Mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESET</name>
              <description>bxCAN software master reset</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MSR</name>
          <description>CAN master status register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INAK</name>
              <description>Initialization Acknowledge</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SLAK</name>
              <description>Sleep Acknowledge</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERRI</name>
              <description>Error Interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUI</name>
              <description>Wakeup Interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SLAKI</name>
              <description>Sleep Acknowledge Interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXM</name>
              <description>Transmit Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXM</name>
              <description>Receive Mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SAMP</name>
              <description>Last Sample Point</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RX</name>
              <description>CAN Rx Signal</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSR</name>
          <description>CAN transmit status register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RQCP0</name>
              <description>Request Completed Mailbox0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXOK0</name>
              <description>Transmission OK of Mailbox0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALST0</name>
              <description>Arbitration Lost for Mailbox0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TERR0</name>
              <description>Transmission Error of Mailbox0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ABRQ0</name>
              <description>Abort Request for Mailbox0</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RQCP1</name>
              <description>Request Completed Mailbox1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXOK1</name>
              <description>Transmission OK of Mailbox1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALST1</name>
              <description>Arbitration Lost for Mailbox1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TERR1</name>
              <description>Transmission Error of Mailbox1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ABRQ1</name>
              <description>Abort Request for Mailbox 1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RQCP2</name>
              <description>Request Completed Mailbox2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXOK2</name>
              <description>Transmission OK of Mailbox 2</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALST2</name>
              <description>Arbitration Lost for mailbox 2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TERR2</name>
              <description>Transmission Error of Mailbox 2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ABRQ2</name>
              <description>Abort Request for Mailbox 2</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CODE</name>
              <description>Mailbox Code</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TME0</name>
              <description>Transmit Mailbox 0 Empty</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TME1</name>
              <description>Transmit Mailbox 1 Empty</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TME2</name>
              <description>Transmit Mailbox 2 Empty</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOW0</name>
              <description>Lowest Priority Flag for Mailbox 0</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOW1</name>
              <description>Lowest Priority Flag for Mailbox 1</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOW2</name>
              <description>Lowest Priority Flag for Mailbox 2</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RF0R</name>
          <description>CAN receive FIFO 0 register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FMP0</name>
              <description>FIFO 0 Message Pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FULL0</name>
              <description>FIFO 0 Full</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FOVR0</name>
              <description>FIFO 0 Overrun</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RFOM0</name>
              <description>Release FIFO 0 Output Mailbox</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RF1R</name>
          <description>CAN receive FIFO 1 register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FMP1</name>
              <description>FIFO 1 Message Pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FULL1</name>
              <description>FIFO 1 Full</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FOVR1</name>
              <description>FIFO 1 Overrun</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RFOM1</name>
              <description>Release FIFO 1 Output Mailbox</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>CAN interrupt enable register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TMEIE</name>
              <description>Transmit Mailbox Empty Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMPIE0</name>
              <description>FIFO Message Pending Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FFIE0</name>
              <description>FIFO Full Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FOVIE0</name>
              <description>FIFO Overrun Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMPIE1</name>
              <description>FIFO Message Pending Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FFIE1</name>
              <description>FIFO Full Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FOVIE1</name>
              <description>FIFO Overrun Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EWGIE</name>
              <description>Error Warning Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPVIE</name>
              <description>Error Passive Interrupt Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOFIE</name>
              <description>Bus-Off Interrupt Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LECIE</name>
              <description>Last Error Code Interrupt Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERRIE</name>
              <description>Error Interrupt Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUIE</name>
              <description>Wakeup Interrupt Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SLKIE</name>
              <description>Sleep Interrupt Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ESR</name>
          <description>CAN error status register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EWGF</name>
              <description>Error Warning Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPVF</name>
              <description>Error Passive Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOFF</name>
              <description>Bus-Off Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LEC</name>
              <description>LEC[2:0] bits (Last Error Code)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>TEC</name>
              <description>Least significant byte of the 9-bit Transmit Error Counter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>REC</name>
              <description>Receive Error Counter</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BTR</name>
          <description>CAN bit timing register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BRP</name>
              <description>Baud Rate Prescaler</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>TS1</name>
              <description>Time Segment 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TS2</name>
              <description>Time Segment 2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SJW</name>
              <description>Resynchronization Jump Width</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>LBKM</name>
              <description>Loop Back Mode (Debug)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SILM</name>
              <description>Silent Mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
