modm-ext/data.modm.io/docs/svd/header_stm32f302x8.svd
        <register>
          <name>CFGR2</name>
          <description>RCC clock configuration register 2</description>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PREDIV</name>
              <description>PREDIV[3:0] bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_1</name>
                  <description>PREDIV input clock not divided</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <description>PREDIV input clock divided by 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_3</name>
                  <description>PREDIV input clock divided by 3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <description>PREDIV input clock divided by 4</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_5</name>
                  <description>PREDIV input clock divided by 5</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_6</name>
                  <description>PREDIV input clock divided by 6</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_7</name>
                  <description>PREDIV input clock divided by 7</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <description>PREDIV input clock divided by 8</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_9</name>
                  <description>PREDIV input clock divided by 9</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_10</name>
                  <description>PREDIV input clock divided by 10</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_11</name>
                  <description>PREDIV input clock divided by 11</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_12</name>
                  <description>PREDIV input clock divided by 12</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_13</name>
                  <description>PREDIV input clock divided by 13</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_14</name>
                  <description>PREDIV input clock divided by 14</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_15</name>
                  <description>PREDIV input clock divided by 15</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <description>PREDIV input clock divided by 16</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC1PRES</name>
              <description>ADC1PRES[8:4] bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HCLK</name>
                  <description>ADC1 clock disabled, ADC1 can use AHB clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_DIV_1</name>
                  <description>ADC1 PLL clock divided by 1</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_DIV_2</name>
                  <description>ADC1 PLL clock divided by 2</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_DIV_4</name>
                  <description>ADC1 PLL clock divided by 4</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_DIV_6</name>
                  <description>ADC1 PLL clock divided by 6</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_DIV_8</name>
                  <description>ADC1 PLL clock divided by 8</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_DIV_10</name>
                  <description>ADC1 PLL clock divided by 10</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_DIV_12</name>
                  <description>ADC1 PLL clock divided by 12</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_DIV_16</name>
                  <description>ADC1 PLL clock divided by 16</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_DIV_32</name>
                  <description>ADC1 PLL clock divided by 32</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_DIV_64</name>
                  <description>ADC1 PLL clock divided by 64</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_DIV_128</name>
                  <description>ADC1 PLL clock divided by 128</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_DIV_256</name>
                  <description>ADC1 PLL clock divided by 256</description>
                  <value>27</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR3</name>
          <description>RCC clock configuration register 3</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>USART1SW</name>
              <description>USART1SW[1:0] bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PCLK1</name>
                  <description>PCLK1 clock used as USART1 clock source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCLK</name>
                  <description>System clock selected as USART1 clock source</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSE</name>
                  <description>LSE oscillator clock used as USART1 clock source</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI</name>
                  <description>HSI oscillator clock used as USART1 clock source</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C1SW</name>
              <description>I2C1SW bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2CSW</name>
              <description>I2CSW bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TIM1SW</name>
              <description>TIM1SW bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM15SW</name>
              <description>TIM15SW bits</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM16SW</name>
              <description>TIM16SW bits</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM17SW</name>
              <description>TIM17SW bits</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
